Drive existence check; Shared Drive
